#### OpenTofu Plan `success`

<details><summary>Show Plan</summary>

```

tofu
data.github_user.davidtabat: Reading...
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-data-migration-tool"]: Refreshing state... [id=mirror-data-migration-tool]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=mirror-magento-cloud-patches]
github_repository.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=mirror-PHPCompatibilityFork]
github_repository.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=mirror-magento-zend-pdf]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=mirror-magento-zend-db]
github_repository.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=mirror-magento-coding-standard]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=mirror-magento-zend-log]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=mirror-magento2-functional-testing-framework]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=mirror-magento-zend-loader]
data.github_user.davidtabat: Read complete after 4s [id=79899333]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=mirror-magento-zend-cache]
github_repository.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=mirror-magento-zend-exception]
github_repository.mirrors["mirror-quality-patches"]: Refreshing state... [id=mirror-quality-patches]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=mirror-magento-zend-memory]
github_membership.users["sprankhub"]: Refreshing state... [id=mageos-opentofu-test:sprankhub]
github_membership.users["johnprendergast"]: Refreshing state... [id=mageos-opentofu-test:johnprendergast]
github_membership.users["Vinai"]: Refreshing state... [id=mageos-opentofu-test:Vinai]
github_membership.users["cmuench"]: Refreshing state... [id=mageos-opentofu-test:cmuench]
github_membership.users["davidtabat"]: Refreshing state... [id=mageos-opentofu-test:davidtabat]
github_membership.users["johnhughes1984"]: Refreshing state... [id=mageos-opentofu-test:johnhughes1984]
github_membership.users["fballiano"]: Refreshing state... [id=mageos-opentofu-test:fballiano]
github_membership.users["DavidLambauer"]: Refreshing state... [id=mageos-opentofu-test:DavidLambauer]
github_membership.users["gowrizrh"]: Refreshing state... [id=mageos-opentofu-test:gowrizrh]
github_membership.users["wigman"]: Refreshing state... [id=mageos-opentofu-test:wigman]
github_membership.users["avstudnitz"]: Refreshing state... [id=mageos-opentofu-test:avstudnitz]
github_membership.users["rhoerr"]: Refreshing state... [id=mageos-opentofu-test:rhoerr]
github_membership.users["damienwebdev"]: Refreshing state... [id=mageos-opentofu-test:damienwebdev]
github_team.teams["distribution"]: Refreshing state... [id=12088200]
github_team.teams["infrastructure"]: Refreshing state... [id=12088197]
github_team.teams["tech-lead"]: Refreshing state... [id=12088202]
github_team.teams["content"]: Refreshing state... [id=12088203]
github_team.teams["async-events"]: Refreshing state... [id=12088201]
github_team.teams["continuous-integration"]: Refreshing state... [id=12088198]
github_repository.repositories["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["magento-gitpod"]: Refreshing state... [id=magento-gitpod]
github_repository.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork]
github_repository.repositories["devdocs"]: Refreshing state... [id=devdocs]
github_repository.repositories["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log]
github_repository.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["meta"]: Refreshing state... [id=meta]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework]
github_repository.repositories["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure]
github_repository.repositories["devdocs-website"]: Refreshing state... [id=devdocs-website]
github_repository.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository.repositories["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws]
github_repository.repositories["mageos-composer"]: Refreshing state... [id=mageos-composer]
github_repository.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader]
github_repository.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory]
github_repository.repositories["github-actions"]: Refreshing state... [id=github-actions]
github_repository.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf]
github_repository.repositories["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_branch_protection.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=BPR_kwDONyr-ms4Dh7ID]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDONyr4ss4Dh7HR]
github_branch_protection.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=BPR_kwDONyr46s4Dh7HW]
github_branch_protection.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=BPR_kwDONyr-7c4Dh7HY]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDONyr3aM4Dh7IT]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDONyr-384Dh7IF]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDONyr_cM4Dh7Hy]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDONyr4184Dh7H0]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDONyr3es4Dh7Hq]
github_branch_protection.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=BPR_kwDONyr9t84Dh7Hh]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDONyr4cM4Dh7IX]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDONyr3cs4Dh7Hu]
github_branch_protection.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=BPR_kwDONyr37M4Dh7II]
github_branch_protection.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=BPR_kwDONyr_GM4Dh7IB]
github_branch_protection.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=BPR_kwDONyr_h84Dh7He]
github_branch_protection.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=BPR_kwDONyr3Yc4Dh7IQ]
github_branch_protection.mirrors["mirror-quality-patches"]: Refreshing state... [id=BPR_kwDONyr3m84Dh7IH]
github_branch_protection.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDONyr3jc4Dh7Hr]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDONyr_os4Dh7HL]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDONyr9kM4Dh7Ia]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDONyr2Xs4Dh7H-]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDONyr-Sc4Dh7Hx]
github_branch_protection.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=BPR_kwDONyr3Uc4Dh7Hc]
github_branch_protection.mirrors["mirror-data-migration-tool"]: Refreshing state... [id=BPR_kwDONyr-Ls4Dh7H3]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDONyr_k84Dh7H6]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDONyr2Zc4Dh7Hk]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDONyr3Ws4Dh7Hw]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDONyr_JM4Dh7IJ]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDONyr9X84Dh7IW]
github_branch_protection.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=BPR_kwDONyr3SM4Dh7IG]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDONyr2pc4Dh7Hg]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDONyr4Z84Dh7IP]
github_team_membership.members["DavidLambauer_content"]: Refreshing state... [id=12088203:DavidLambauer]
github_team_membership.members["avstudnitz_async-events"]: Refreshing state... [id=12088201:avstudnitz]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=12088197:damienwebdev]
github_team_membership.members["rhoerr_infrastructure"]: Refreshing state... [id=12088197:rhoerr]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=12088203:johnhughes1984]
github_team_membership.members["davidtabat_infrastructure"]: Refreshing state... [id=12088197:davidtabat]
github_team_membership.members["wigman_content"]: Refreshing state... [id=12088203:wigman]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=12088197:Vinai]
github_team_membership.members["cmuench_infrastructure"]: Refreshing state... [id=12088197:cmuench]
github_team_membership.members["davidtabat_content"]: Refreshing state... [id=12088203:davidtabat]
github_team_membership.members["davidtabat_async-events"]: Refreshing state... [id=12088201:davidtabat]
github_team_membership.members["davidtabat_distribution"]: Refreshing state... [id=12088200:davidtabat]
github_team_membership.members["davidtabat_tech-lead"]: Refreshing state... [id=12088202:davidtabat]
github_team_membership.members["rhoerr_distribution"]: Refreshing state... [id=12088200:rhoerr]
github_team_membership.members["fballiano_infrastructure"]: Refreshing state... [id=12088197:fballiano]
github_team_membership.members["gowrizrh_async-events"]: Refreshing state... [id=12088201:gowrizrh]
github_team_membership.members["DavidLambauer_infrastructure"]: Refreshing state... [id=12088197:DavidLambauer]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=12088200:sprankhub]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=12088202:Vinai]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=12088200:Vinai]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=12088203:Vinai]
github_team_membership.members["davidtabat_continuous-integration"]: Refreshing state... [id=12088198:davidtabat]
github_team_membership.members["johnprendergast_content"]: Refreshing state... [id=12088203:johnprendergast]
github_team_membership.members["fballiano_distribution"]: Refreshing state... [id=12088200:fballiano]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=12088197:sprankhub]
github_team_membership.members["damienwebdev_distribution"]: Refreshing state... [id=12088200:damienwebdev]
github_branch_protection.repositories-release-please["github-actions"]: Refreshing state... [id=BPR_kwDONyr8ws4Dh7Dj]
github_branch_protection.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=BPR_kwDONyr5H84Dh7FU]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDONyr6fM4Dh7Ek]
github_branch_protection.repositories["mageos-async-events-azure"]: Refreshing state... [id=BPR_kwDONyr6t84Dh7Ee]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDONyr9rM4Dh7FD]
github_branch_protection.repositories["mageos-common-async-events"]: Refreshing state... [id=BPR_kwDONyr2bs4Dh7E7]
github_branch_protection.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=BPR_kwDONyr6Fc4Dh7E6]
github_branch_protection.repositories["mageos-magento-zend-db"]: Refreshing state... [id=BPR_kwDONyr6Zc4Dh7GB]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDONyr8T84Dh7GC]
github_branch_protection.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=BPR_kwDONyr6YM4Dh7Em]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDONyr8Dc4Dh7FM]
github_branch_protection.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=BPR_kwDONyr57M4Dh7FL]
github_branch_protection.repositories["devdocs"]: Refreshing state... [id=BPR_kwDONyr7YM4Dh7F-]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDONyr9b84Dh7FO]
github_branch_protection.repositories["github-actions"]: Refreshing state... [id=BPR_kwDONyr8ws4Dh7FT]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDONyr86s4Dh7FQ]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDONyr9Nc4Dh7Ef]
github_branch_protection.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDONyr5Ac4Dh7Ed]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDONyr82s4Dh7FV]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDONyr5Ds4Dh7E9]
github_branch_protection.repositories["meta"]: Refreshing state... [id=BPR_kwDONyr7_c4Dh7FR]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDONyr6DM4Dh7GE]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDONyr7vc4Dh7E4]
github_branch_protection.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=BPR_kwDONyr7984Dh7El]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDONyr6l84Dh7Ei]
github_branch_protection.repositories["mageos-async-events-sinks"]: Refreshing state... [id=BPR_kwDONyr7UM4Dh7F4]
github_branch_protection.repositories["devdocs-website"]: Refreshing state... [id=BPR_kwDONyr5-M4Dh7E1]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDONyr6hM4Dh7GA]
github_branch_protection.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=BPR_kwDONyr60s4Dh7E-]
github_branch_protection.repositories["mageos-async-events"]: Refreshing state... [id=BPR_kwDONyr6SM4Dh7E8]
github_branch_protection.repositories["mageos-async-events-gcp"]: Refreshing state... [id=BPR_kwDONyr-PM4Dh7FA]
github_branch_protection.repositories["mageos-magento-zend-log"]: Refreshing state... [id=BPR_kwDONyr5K84Dh7F5]
github_branch_protection.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=BPR_kwDONyr5L84Dh7Eh]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDONyr-Oc4Dh7E_]
github_branch_protection.repositories["mageos-composer"]: Refreshing state... [id=BPR_kwDONyr8Ls4Dh7Ej]
github_branch_protection.repositories["mageos-async-events-aws"]: Refreshing state... [id=BPR_kwDONyr72M4Dh7FS]
github_branch_protection.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=BPR_kwDONyr7dM4Dh7FN]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDONyr8Wc4Dh7En]
github_branch_default.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository_file.codeowners["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events"]: Refreshing state... [id=mageos-async-events/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui/CODEOWNERS]
github_repository_file.codeowners["mageos-composer"]: Refreshing state... [id=mageos-composer/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["github-actions"]: Refreshing state... [id=github-actions/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/CODEOWNERS]
github_repository_file.codeowners["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/CODEOWNERS]
github_repository_file.codeowners["devdocs"]: Refreshing state... [id=devdocs/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks/CODEOWNERS]
github_repository_file.codeowners["meta"]: Refreshing state... [id=meta/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp/CODEOWNERS]
github_repository_file.codeowners["devdocs-website"]: Refreshing state... [id=devdocs-website/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_team_repository.tech-lead["mageos-magento-zend-memory"]: Refreshing state... [id=12088202:mageos-magento-zend-memory]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=12088202:terraform]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=12088202:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["mageos-magento-coding-standard"]: Refreshing state... [id=12088202:mageos-magento-coding-standard]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=12088202:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-magento-zend-loader"]: Refreshing state... [id=12088202:mageos-magento-zend-loader]
github_team_repository.tech-lead["mageos-magento-zend-exception"]: Refreshing state... [id=12088202:mageos-magento-zend-exception]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=12088202:mageos-inventory]
github_team_repository.tech-lead["mageos-async-events-gcp"]: Refreshing state... [id=12088202:mageos-async-events-gcp]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=12088202:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=12088202:infrastructure]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=12088202:namespace]
github_team_repository.tech-lead["mageos-common-async-events"]: Refreshing state... [id=12088202:mageos-common-async-events]
github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=12088202:mageos-magento2-functional-testing-framework]
github_team_repository.tech-lead["github-actions"]: Refreshing state... [id=12088202:github-actions]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=12088202:mageos-magento2-page-builder]
github_team_repository.tech-lead["mageos-async-events-admin-ui"]: Refreshing state... [id=12088202:mageos-async-events-admin-ui]
github_team_repository.tech-lead["mageos-magento-zend-db"]: Refreshing state... [id=12088202:mageos-magento-zend-db]
github_team_repository.tech-lead["mageos-magento-zend-pdf"]: Refreshing state... [id=12088202:mageos-magento-zend-pdf]
github_team_repository.tech-lead["meta"]: Refreshing state... [id=12088202:meta]
github_team_repository.tech-lead["mageos-composer"]: Refreshing state... [id=12088202:mageos-composer]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=12088202:mage-os-website]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=12088202:mageos-adobe-stock-integration]
github_team_repository.tech-lead["devdocs"]: Refreshing state... [id=12088202:devdocs]
github_team_repository.tech-lead["devdocs-website"]: Refreshing state... [id=12088202:devdocs-website]
github_team_repository.tech-lead["mageos-async-events-azure"]: Refreshing state... [id=12088202:mageos-async-events-azure]
github_team_repository.tech-lead["mageos-magento-zend-log"]: Refreshing state... [id=12088202:mageos-magento-zend-log]
github_team_repository.tech-lead["mageos-async-events-aws"]: Refreshing state... [id=12088202:mageos-async-events-aws]
github_team_repository.tech-lead["mageos-PHPCompatibilityFork"]: Refreshing state... [id=12088202:mageos-PHPCompatibilityFork]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=12088202:mageos-magento-composer-installer]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=12088202:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-async-events"]: Refreshing state... [id=12088202:mageos-async-events]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=12088202:mageos-magento2-sample-data]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=12088202:mageos-magento2]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=12088202:mageos-security-package]
github_team_repository.tech-lead["mageos-async-events-sinks"]: Refreshing state... [id=12088202:mageos-async-events-sinks]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=12088202:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-magento-zend-cache"]: Refreshing state... [id=12088202:mageos-magento-zend-cache]
github_team_repository.tech-lead["magento-gitpod"]: Refreshing state... [id=12088202:magento-gitpod]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=12088197:generate-mirror-repo-js]
github_team_repository.teams["magento-gitpod_infrastructure"]: Refreshing state... [id=12088197:magento-gitpod]
github_team_repository.teams["mageos-async-events-sinks_async-events"]: Refreshing state... [id=12088201:mageos-async-events-sinks]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=12088200:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-async-events-azure_async-events"]: Refreshing state... [id=12088201:mageos-async-events-azure]
github_team_repository.teams["mageos-magento-zend-log_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-log]
github_team_repository.teams["mageos-async-events-gcp_distribution"]: Refreshing state... [id=12088200:mageos-async-events-gcp]
github_team_repository.teams["mageos-async-events-azure_distribution"]: Refreshing state... [id=12088200:mageos-async-events-azure]
github_team_repository.teams["mageos-async-events-admin-ui_distribution"]: Refreshing state... [id=12088200:mageos-async-events-admin-ui]
github_team_repository.teams["mageos-magento-zend-exception_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-exception]
github_team_repository.teams["mageos-async-events-gcp_async-events"]: Refreshing state... [id=12088201:mageos-async-events-gcp]
github_team_repository.teams["terraform_infrastructure"]: Refreshing state... [id=12088197:terraform]
github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"]: Refreshing state... [id=12088200:mageos-magento2-functional-testing-framework]
github_team_repository.teams["mageos-common-async-events_async-events"]: Refreshing state... [id=12088201:mageos-common-async-events]
github_team_repository.teams["mageos-async-events-aws_async-events"]: Refreshing state... [id=12088201:mageos-async-events-aws]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=12088197:infrastructure]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=12088200:mageos-magento-composer-installer]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=12088200:mageos-commerce-data-export]
github_team_repository.teams["meta_continuous-integration"]: Refreshing state... [id=12088198:meta]
github_team_repository.teams["mageos-composer_distribution"]: Refreshing state... [id=12088200:mageos-composer]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=12088203:mage-os-website]
github_team_repository.teams["meta_tech-lead"]: Refreshing state... [id=12088202:meta]
github_team_repository.teams["mageos-async-events-aws_distribution"]: Refreshing state... [id=12088200:mageos-async-events-aws]
github_team_repository.teams["mageos-async-events-sinks_distribution"]: Refreshing state... [id=12088200:mageos-async-events-sinks]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=12088200:mageos-security-package]
github_team_repository.teams["mageos-magento-zend-cache_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-cache]
github_team_repository.teams["mageos-async-events-admin-ui_async-events"]: Refreshing state... [id=12088201:mageos-async-events-admin-ui]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=12088200:mageos-magento2-sample-data]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=12088200:mageos-magento2-page-builder]
github_team_repository.teams["meta_content"]: Refreshing state... [id=12088203:meta]
github_team_repository.teams["devdocs_infrastructure"]: Refreshing state... [id=12088197:devdocs]
github_team_repository.teams["devdocs-website_infrastructure"]: Refreshing state... [id=12088197:devdocs-website]
github_team_repository.teams["devdocs-website_content"]: Refreshing state... [id=12088203:devdocs-website]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=12088200:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-async-events_async-events"]: Refreshing state... [id=12088201:mageos-async-events]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=12088200:mageos-inventory]
github_team_repository.teams["mageos-magento-zend-pdf_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-pdf]
github_team_repository.teams["meta_infrastructure"]: Refreshing state... [id=12088197:meta]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=12088200:mageos-magento2]
github_team_repository.teams["mageos-PHPCompatibilityFork_distribution"]: Refreshing state... [id=12088200:mageos-PHPCompatibilityFork]
github_team_repository.teams["mageos-magento-zend-db_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-db]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=12088200:mageos-composer-root-update-plugin]
github_team_repository.teams["mageos-async-events_distribution"]: Refreshing state... [id=12088200:mageos-async-events]
github_team_repository.teams["mageos-common-async-events_distribution"]: Refreshing state... [id=12088200:mageos-common-async-events]
github_team_repository.teams["github-actions_infrastructure"]: Refreshing state... [id=12088197:github-actions]
github_team_repository.teams["mageos-magento-zend-memory_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-memory]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=12088200:mageos-inventory-composer-installer]
github_team_repository.teams["mageos-magento-zend-loader_distribution"]: Refreshing state... [id=12088200:mageos-magento-zend-loader]
github_team_repository.teams["mageos-magento-coding-standard_distribution"]: Refreshing state... [id=12088200:mageos-magento-coding-standard]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=12088197:namespace]
github_team_repository.teams["devdocs_content"]: Refreshing state... [id=12088203:devdocs]
github_team_repository.teams["meta_distribution"]: Refreshing state... [id=12088200:meta]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["github-actions"]: Refreshing state... [id=github-actions/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2"]: Refreshing state... [id=mageos-magento2/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-composer"]: Refreshing state... [id=mageos-composer/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-security-package"]: Refreshing state... [id=mageos-security-package/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-inventory"]: Refreshing state... [id=mageos-inventory/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["devdocs-website"]: Refreshing state... [id=devdocs-website/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["namespace"]: Refreshing state... [id=namespace/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["meta"]: Refreshing state... [id=meta/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["terraform"]: Refreshing state... [id=terraform/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["infrastructure"]: Refreshing state... [id=infrastructure/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events"]: Refreshing state... [id=mageos-async-events/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["devdocs"]: Refreshing state... [id=devdocs/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/.github/workflows/sansec-ecomscan.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer"]: Refreshing state... [id=mageos-composer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2"]: Refreshing state... [id=mageos-magento2/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-inventory"]: Refreshing state... [id=mageos-inventory/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-security-package"]: Refreshing state... [id=mageos-security-package/.github/workflows/merge-upstream-changes.yml]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # github_branch_protection.repositories["test-plan"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOC8Niq84AuHOK",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }

      + restrict_pushes {
          + blocks_creations = true
          + push_allowances  = [
              + "T_kwDOC8Niq84AuHOF",
            ]
        }
    }

  # github_repository.repositories["test-plan"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Test plan."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-plan"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "adobecommerce",
          + "ecommerce",
          + "mage-os",
          + "magento2",
        ]
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_file.codeowners["test-plan"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = (known after apply)
      + commit_author                = "davidtabat"
      + commit_email                 = "info@mage-os.org"
      + commit_message               = "Managed by OpenTofu"
      + commit_sha                   = (known after apply)
      + content                      = "* @mageos-opentofu-test/infrastructure"
      + file                         = "CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "test-plan"
      + sha                          = (known after apply)
    }

  # github_repository_file.sansec_ecomscan_workflow["test-plan"] will be created
  + resource "github_repository_file" "sansec_ecomscan_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = (known after apply)
      + commit_author                = "davidtabat"
      + commit_email                 = "info@mage-os.org"
      + commit_message               = "Add Sansec eComscan workflow"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            name: Sansec eComscan Security Scan
            
            on:
              push:
              pull_request_target:
              workflow_dispatch:
            
            jobs:
              run-ecomscan:
                name: Run Sansec eComscan
                runs-on: ubuntu-latest
                permissions:
                  contents: read
                  pull-requests: read
            
                steps:
                  - name: Checkout repository
                    uses: actions/checkout@v4
                    with:
                      ref: ${{ github.event.pull_request.head.sha }}
                      persist-credentials: false
            
                  - name: Download eComscan
                    run: wget https://ecomscan.com/downloads/linux-amd64/ecomscan
            
                  - name: Fix permissions
                    run: chmod +x ecomscan
            
                  - name: Run eComscan
                    env:
                      ECOMSCAN_KEY: ${{ secrets.SANSEC_LICENSE_KEY }}
                    run: |
                      output=$(./ecomscan --no-auto-update --skip-database --deep --format=csv .)
                      if [ -n "$output" ]; then
                        echo "Security issues found:"
                        echo "$output"
                        exit 1
                      fi
        EOT
      + file                         = ".github/workflows/sansec-ecomscan.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "test-plan"
      + sha                          = (known after apply)
    }

  # github_team_repository.teams["meta_tech-lead"] will be updated in-place
  ~ resource "github_team_repository" "teams" {
        id         = "12088202:meta"
      ~ permission = "maintain" -> "push"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["test-plan_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test-plan"
      + team_id    = "infrastructure"
    }

  # github_team_repository.tech-lead["test-plan"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "test-plan"
      + team_id    = "12088202"
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

Issuer: @davidtabat, Action: https://github.com/mageos-opentofu-test/terraform/actions/runs/13087009864